CREATE TABLE subjects (
    id SERIAL PRIMARY KEY,
    title VARCHAR(100) NOT NULL,
    description VARCHAR(100) NOT NULL
);

INSERT INTO subjects (title, description)
VALUES
    ('Українська мова', 'Вивчення української мови, граматики та стилістики'),
    ('Українська література', 'Аналіз творів українських письменників'),
    ('Зарубіжна література', 'Ознайомлення зі світовою літературною спадщиною'),
    ('Історія України', 'Вивчення історії України з найдавніших часів до сьогодення'),
    ('Всесвітня історія', 'Основні події світової історії'),
    ('Алгебра', 'Вивчення алгебраїчних виразів, рівнянь та функцій'),
    ('Геометрія', 'Вивчення властивостей геометричних фігур та просторових форм'),
    ('Фізика', 'Закони механіки, електрики, магнетизму, оптики'),
    ('Хімія', 'Основи хімії, властивості речовин і реакції'),
    ('Біологія', 'Будова організмів, клітинні процеси, екологія'),
    ('Географія', 'Природні та соціально-економічні особливості світу та України'),
    ('Інформатика', 'Основи програмування, алгоритми, робота з комп’ютером'),
    ('Англійська мова', 'Вивчення англійської мови, лексика і граматика'),
    ('Німецька мова', 'Вивчення німецької мови як другої іноземної'),
    ('Французька мова', 'Вивчення французької мови як другої іноземної'),
    ('Фізична культура', 'Фізичний розвиток, спортивні ігри, вправи'),
    ('Захист України', 'Основи оборони, цивільного захисту та військової підготовки'),
    ('Мистецтво', 'Образотворче мистецтво, музика, театр, кіно'),
    ('Технології', 'Трудове навчання, проєктна діяльність, практичні навички');
